[
  {
    "company": "spletna postaja d.o.o | Part-time/Internship",
    "title": "Contert Editor & Web Developer",
    "year": "Jun 2024 - Sep 2025",
    "description": "At Spletna Postaja, I’ve been responsible for editing and maintaining websites and online stores using October CMS. My work includes updating content, improving site structure, and ensuring everything looks and works as intended. I also assist project managers with day-to-day tasks, test new features before launch, and create easy-to-follow user instructions for clients. I deffinitly gained valuable experience in web development and project management."
  },
  {
    "company": "PC7 d.o.o. | Internship",
    "title": "Web Developer",
    "year": "Mar 2023 - Jun 2023",
    "description": "During my internship at PC7, I worked on creating,managing and updating WordPress websites and e-commerce platforms. I created website for rating AI tools and e-commerce platform selling beauty products. I also gained hands-on experience with Laravel, which gave me a deeper understanding of modern web development practices. On top of that, I contributed to the testing and improvement of an AI-driven application for file communication, where I helped ensure smooth functionality and usability."
  },
  {
    "company": "Elektromonter d.o.o. | Part-time/Internship",
    "title": "Electrician",
    "year": "Apr 2019 - Feb 2020",
    "description": "At Elektromonter, I first started by assembling the frames of electrical cabinets, focusing on the basic structure and preparation work. After a few months, I progressed to independently wiring entire cabinets according to technical plans. This step-by-step growth gave me valuable hands-on experience, improved my precision, and strengthened my ability to follow detailed electrical schematics with confidence."
  },
  {
    "company": "Bambus parketi in terase d.o.o. | Part-time",
    "title": "Warehouse Worker",
    "year": "May 2018 - Aug 2018",
    "description": "My role at Bambus Parketi was focused on preparing and packaging customer orders in the warehouse. I learned the importance of efficiency, organization, and accuracy when handling products and coordinating shipments. While not directly related to IT, this job helped me build a strong work ethic and taught me how to manage time effectively in a busy, hands-on environment."
  }
]
